grpc-vs-rest-benchmark/load-tests/testing-results/100-RPS/gRPC.txt
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |     7,800 |     7,800 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |     4,243 |     4,243 |         -
> mean response time (ms)                                                            |        17 |        17 |         -
> response time std deviation (ms)                                                   |       176 |       176 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |         5 |         5 |         -
> response time 95th percentile (ms)                                                 |        15 |        15 |         -
> response time 99th percentile (ms)                                                 |        56 |        56 |         -
> mean throughput (rps)                                                              |     74.29 |     74.29 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          7,767 (99.58%)
> OK: 800 ms <= t < 1200 ms                                                                                   4  (0.05%)
> OK: t >= 1200 ms                                                                                           29  (0.37%)
> KO                                                                                                          0     (0%)
========================================================================================================================